{
    "project": {
        "name": "Rozšírenie modelera procesných modelov o možnosť kolaborácie",
        "about": "Cieľom tímového projektu je rozšíriť modeler procesných aplikácií o technológiu Websockets tak, aby mohlo viacero používateľov v jednej chvíli spolupracovať na modelovaní konkrétneho procesného modelu. Naviac treba navrhnúť spôsob, akým riešiť konflikty v rámci navrhovania formulárov v sekcií generátora formulárov, a rozšíriť ho o ttechnológiu Websokets tak, aby tak isto mohlo viacero používateľov v jednej chvíli spolupracovať na vytváraní jedného kontneho formuláru.",
        "givenBy": "Ing. Tomáš Kováčik",
        "photo": "/assets/img/kovacik.jpg"
    },
    "reports": [
        {
          "day": "18.10.2020",
          "title": "3# Report",
          "subtitle": "",
          "text": "Tento týždeň sme si s vedúcim tímu prešli zdrojový kód Angular aplikácie cez video hovor. Následne nám bol poskytnutý aby sme si ho mohli pozrieť všetci aj individuálne a potom si spoločne prejsť prípadné nejasnosti. \n\nNa ďalší týždeň po analyzovaní kódu budeme kontaktovať vedúceho tímu s prípadnými otázkami a následnom rozdelení práce kto bude na čom pracovať. Zároveň budeme hlbšie riešiť aj otázky ohľadom serverovej časti spomenuté v reporte číslo 2.\n",
          "jobs": [
            "Analýza produkčnej verzie modelera",
            "Analýza Angular kódu aplikácie",
            "Štúdium Spring Boot frameworku",
            "Analýza synchronizácie modelu"
          ],
          "todo": [
            "Budúci týždeň budeme riešiť rozdelenie úloh po prezretí Angular zdrojového kódu, prípadne iné otázky v prípade nejasností."
          ]
        },
        {
            "day": "11.10.2020",
            "title": "2# Report",
            "subtitle": "",
            "text": "Tento týždeň sme plánovali analýzu súčasného Angular kódu v ktorom je modeler naprogramovaný. Nanešťastie sme však po konzultácii s vedúcim projektu museli prevzatie kódu odložiť na ďalší týždeň a teda aj jeho analýzu sme presunuli o týždeň neskôr.\n\nMedzi tým sme však riešili otázky ohľadom serverovej časti tohto projektu. Keďže ešte nemáme Angular kód tak sme si pozerali aspoň produkčné riešenie priamo na stránke http://builder.interes.group/modeler kde sme pozerali ako vyzerajú jednotlivé objekty. \n\nNa základe týchto nie úplne presných dát sme spolu konzultovali ako bude prebiehať samotná synchronizácia vytváraného modelu napr. či budeme vždy posielať všetky dáta konkrétneho užívateľa, a následne porovnali zmeny, alebo len tie aktuálne ktoré vykonáva. Rovnako sme riešili nutnosť vytvorenia miestností aby si každá skupina mohla vytvoriť svoju vlastnú a taktiež ukladanie aktuálneho stavu modelu aby keď sa niekto pripojí do kolaborácie neskôr tak videl aktuálny stav modelu.\n",
            "jobs": [
                "Analýza produkčnej verzie modelera",
                "Štúdium Spring Boot frameworku",
                "Analýza synchronizácie modelu"
            ],
            "todo": [
                "Budúci týždeň už by sme mali dostať aktuálny kód vďaka čomu si budeme môcť diskutované problémy upresniť a pokračovať v práci či už na serverovej ale aj na klientskej časti aplikácie."
            ]
        },
        {
            "day": "2.10.2020",
            "title": "1# Report",
            "text": "Tento týždeň sme si s vedúcim projektu dohodli úvodnú konzultáciu kde sme sa dozvedeli viaceré informácie ohľadom aktuálneho stavu projektu. Oboznámili sme sa s frameworkom Angular keďže frontend je postavený práve na ňom a rovnako s frameworkom Spring Boot, ktorý, po odporučení vedúcim projektu, využijeme na tvorbu serverovej časti.\nZaložili sme GitHub repozitár, zdieľaný priečinok pre budúce materiály a aktualizovali tímovú stránku.\n",
            "jobs": [
                "Štúdium Angular frameworku",
                "Štúdium Spring Boot frameworku"
            ],
            "todo": [
                "Budúci týždeň po dohode s vedúcim projektu dostaneme aktuálny kód s ktorým budeme môcť začať pracovať."
            ]
        }
    ]
}